# 2k = -9     ---变量不能数字开头，改为k2
#   if 2k>= 0:  ---if前方有空格，变量命名不对
#     with = 2k +"正数"   ----变量命名错误，with更改为a
#                         ----- (str)和(int)类型不能使用+进行拼接，应该将k2转换类型为(str)
#         print(with)     ----更改为print(a)
#     else:              -----同一级别的代码，缩进一致。这里要与if对齐
#     print(2K+ '负数")   -----1.字符串的表示方法' "错误，改为""
#                              2.(str)和(int)类型不能使用+进行拼接，应该将k2转换类型为(str)
#                              3.变量名字没有区分大小写,且类型需转换

#代码改正

k2 = -9
if k2 >= 0:
    a=str(k2)+"正数"
    print(a)
else:
    print(str(k2)+"负数")