#面向对象编程练习
# 编写一个打怪兽的小游戏。
# 游戏要求如下：
# 1. 游戏中角色有英雄和怪兽两种大类型。
# 2. 游戏中英雄和怪兽轮流发送攻击，知道有一方死亡。
# 3. 英雄具有名字、级别(共3级），当前生命，当前等级的最大生命、种族和灵活性等属性，具有攻击和防御方法；
#    攻击时，根据当前的等级，在一个给定范围内产生一个随机数作为攻击点数。被攻击对象即受到次点数的攻击。
#    例如级别为1时在[0,10)范围内随机产生一个数作为攻击力，级别为2级在[0,20)范围内产生一个数作为攻击力。
#    英雄具有两个可选种族，人类和精灵。 种族决定了灵活性的高低。
#    受到攻击时，根据灵活性，可以躲避掉对方的攻击。 例如：当前英雄灵活性为0.4， 在受到对方m点攻击时，产
#    生一个（0，1）之间的随机数，如果随机数小于灵活性0.4，则躲避掉此次攻击不受到伤害，否则受到m点伤害。!!!!
# 4. 怪兽也具有名字、级别(共3级），当前生命，当前等级的最大生命属性。 具有攻击和防御方法；
#    怪兽级别共3级，第1，第2级只有级别带来的攻击力差异。 第三级为大怪兽。
#    所有怪兽的攻击方法与英雄的攻击方法原理相同。根据当前的等级，在一个给定范围内产生一个随机数作为攻击点数。
#    被攻击对象即受到次点数的攻击。
#    大怪兽具有一个额外的盾牌属性。收到攻击的时候，首先减少盾牌的防御，盾牌防御减少为0 的以后才减少生命。
# 5. 编写一个总的入口程序，生成一个英雄， 两个低等级怪兽，一个大怪兽， 设定循环条件是英雄和怪兽按顺序轮流发送攻击，
#    直到英雄死亡或所有怪兽被杀死。
# 6. 游戏过程中在每回合攻击、防御后应打印输出受到的伤害，以及当前的生命。游戏最后打印英雄是Win还是Lose。
import random
class Hero:
    name = ""
    level = 1
    nowLife = 250+50*level
    maxLife = 250+50*level
    nation = False
    Flexibility = random.randint(0,7)/10
    att = 0
    flag = True
    def HP(self):
        self.nowLife = self.nowLife + 50
        self.maxLife = 250 + 50 * self.level
    def attack(self):
        Hero.att = random.randint(0,10*Hero.level)
        return Hero.att

    def Na(monster):
        if Hero.nation == False:
            # print('这个英雄是人类')
            Hero.Flexibility = random.randint(0,7)/10
            return random.randint(0,7)/10
        else:
            # print('这个英雄是精灵')
            Hero.Flexibility = random.randint(0,10)/10
            return random.randint(0,10)/10

    def Panduan(self):
        Hero.Na()
        if Hero.Flexibility <= 0.4:
            print("英雄闪避了攻击")
            return False
        else:
            return True
    def __init__(self,name,nation):
        self.name = name
        self.nation = nation
        if self.nation == False:
            # print('这个英雄是人类')
            self.Flexibility = random.randint(0,7)/10
        elif self.nation == True:
            # print('这个英雄是精灵')
            self.Flexibility = random.randint(0,10)/10
    def lost(self,L):
        print(self.name + "受到了" + str(L) + "伤害")
        self.nowLife -= L
        if(self.nowLife<=0):
            print(self.name+"lose")
            self.flag = False


class monster:
    level = 1
    name = ""
    nowLife = 50 + 10 * level
    maxLife = 50 + 10 * level
    att = 0
    dun = 0
    flag = True
    l = 0

    def attack(self):
        monster.att = 3 + random.randint(0, 5)  * self.level
        if Hero.Na(self) > 0.4:
            return monster.att
        else:
            print(self.name+"的攻击被闪避"+"英雄未受到伤害！！！")
            return 0

    def D(self):
        if self.level == 3:
            print("这是个大怪兽！,有一个可以隔挡2血的盾")
            self.dun = 2
        return self.dun
    def lost(self,L):
        self.D()
        print(self.name+"受到了"+str(L)+"伤害")
        self.nowLife += (int((self.dun - L)))

        if(self.nowLife<=0):
            print(self.name+"lose")
            self.flag = False
            print(hero1.name+"   Level up !!!")
            hero1.level+=1
            hero1.HP()
    def __init__(self,name,level):
        self.name = name
        self.level =level
#   False 代表种族是人类
#   True  代表种族是精灵
#   创建3个对象  1个英雄 3个怪兽
Hname = input("请为您的英雄取一个昵称：")
NA = input("请输入True或者False为您的英雄选定种族(True代表精灵，False代表人类)：")
hero1 = Hero(Hname,NA)
monster1 = monster("小兵A",1)
monster2 = monster("小兵B",2)
monster3 = monster("大BOSS",3)
# 5. 编写一个总的入口程序，生成一个英雄， 两个低等级怪兽，一个大怪兽， 设定循环条件是英雄和怪兽按顺序轮流发送攻击，
#    直到英雄死亡或所有怪兽被杀死。
# 6. 游戏过程中在每回合攻击、防御后应打印输出受到的伤害，以及当前的生命。游戏最后打印英雄是Win还是Lose。
print("============================英雄打怪兽游戏开始！！！=============================")
for round in range (1,99):
    print("-------------------------"+"第" + str(round) + "回合"+"---------------------------")
    if(hero1.flag==False):
        print(hero1.name+"Lose")
        print(hero1.name+"死亡！！游戏结束！！！")
        break
    else:
        if(monster1.flag):
            print(hero1.name+"("+"Level:"+str(hero1.level)+")" + "开始攻击" + monster1.name)
            heroATT = hero1.attack()
            # print(monster1.name+"剩余血量"+str(monster1.nowLife)+"/"+str(monster1.maxLife))
            monster1.lost(heroATT)
            print(monster1.name + "剩余血量" + str(monster1.nowLife)+"/"+str(monster1.maxLife))
        elif(monster2.flag and monster1.flag==False):
            print(hero1.name+"("+"Level:"+str(hero1.level)+")"  + "开始攻击" + monster2.name)
            heroATT = hero1.attack()
            # print(monster2.name + "剩余血量" + str(monster2.nowLife)+"/"+str(monster2.maxLife))
            monster2.lost(heroATT)
            print(monster2.name + "剩余血量" + str(monster2.nowLife)+"/"+str(monster2.maxLife))
        elif(monster3.flag and monster1.flag==False and monster2.flag==False):
            print(hero1.name+"("+"Level:"+str(hero1.level)+")"  + "开始攻击" + monster3.name)
            heroATT = hero1.attack()
            # print(monster3.name + "剩余血量" + str(monster3.nowLife)+"/"+str(monster3.maxLife))
            monster3.lost(heroATT)
            print(monster3.name + "剩余血量" + str(monster3.nowLife)+"/"+str(monster3.maxLife))
    if(monster1.flag == False and monster2.flag == False and monster3.flag == False ):
        print("怪兽全部死亡！！！游戏结束！！！！")
        print( hero1.name + "WIN!!!")
        break
    else:
        if(monster1.flag):
            print(monster1.name + "开始攻击" + hero1.name)
            m1 = monster1.attack()
            # print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
            hero1.lost(m1)
            print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
        if(monster2.flag and monster1.flag == False):
            print(monster2.name + "开始攻击" + hero1.name)
            m2 = monster2.attack()
            # print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
            hero1.lost(m2)
            print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
        if(monster3.flag and monster1.flag==False and monster2.flag ==False):
            print(monster3.name + "开始攻击" + hero1.name)
            m3 = monster3.attack()
            # print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
            hero1.lost(m3)
            print(hero1.name + "剩余血量" + str(hero1.nowLife)+"/"+str(hero1.maxLife))
    print()
# 运行结果
# 请为您的英雄取一个昵称：齐天大圣
# 请输入True或者False为您的英雄选定种族(True代表精灵，False代表人类)：True
# ============================英雄打怪兽游戏开始！！！=============================
# -------------------------第1回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了3伤害
# 小兵A剩余血量57/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量300/300
#
# -------------------------第2回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了4伤害
# 小兵A剩余血量53/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了3伤害
# 齐天大圣剩余血量297/300
#
# -------------------------第3回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了7伤害
# 小兵A剩余血量46/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了4伤害
# 齐天大圣剩余血量293/300
#
# -------------------------第4回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了6伤害
# 小兵A剩余血量40/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量293/300
#
# -------------------------第5回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了2伤害
# 小兵A剩余血量38/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量293/300
#
# -------------------------第6回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了2伤害
# 小兵A剩余血量36/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量293/300
#
# -------------------------第7回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了10伤害
# 小兵A剩余血量26/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了7伤害
# 齐天大圣剩余血量286/300
#
# -------------------------第8回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了1伤害
# 小兵A剩余血量25/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了6伤害
# 齐天大圣剩余血量280/300
#
# -------------------------第9回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了5伤害
# 小兵A剩余血量20/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了8伤害
# 齐天大圣剩余血量272/300
#
# -------------------------第10回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了3伤害
# 小兵A剩余血量17/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量272/300
#
# -------------------------第11回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了8伤害
# 小兵A剩余血量9/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量272/300
#
# -------------------------第12回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了8伤害
# 小兵A剩余血量1/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量272/300
#
# -------------------------第13回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了0伤害
# 小兵A剩余血量1/60
# 小兵A开始攻击齐天大圣
# 小兵A的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量272/300
#
# -------------------------第14回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了0伤害
# 小兵A剩余血量1/60
# 小兵A开始攻击齐天大圣
# 齐天大圣受到了7伤害
# 齐天大圣剩余血量265/300
#
# -------------------------第15回合---------------------------
# 齐天大圣(Level:1)开始攻击小兵A
# 小兵A受到了3伤害
# 小兵Alose
# 齐天大圣   Level up !!!
# 小兵A剩余血量-2/60
# 小兵B开始攻击齐天大圣
# 小兵B的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量315/350
#
# -------------------------第16回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了2伤害
# 小兵B剩余血量58/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了9伤害
# 齐天大圣剩余血量306/350
#
# -------------------------第17回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了3伤害
# 小兵B剩余血量55/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了13伤害
# 齐天大圣剩余血量293/350
#
# -------------------------第18回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了5伤害
# 小兵B剩余血量50/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了5伤害
# 齐天大圣剩余血量288/350
#
# -------------------------第19回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了8伤害
# 小兵B剩余血量42/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了13伤害
# 齐天大圣剩余血量275/350
#
# -------------------------第20回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了5伤害
# 小兵B剩余血量37/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了5伤害
# 齐天大圣剩余血量270/350
#
# -------------------------第21回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了8伤害
# 小兵B剩余血量29/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了9伤害
# 齐天大圣剩余血量261/350
#
# -------------------------第22回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了10伤害
# 小兵B剩余血量19/60
# 小兵B开始攻击齐天大圣
# 小兵B的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量261/350
#
# -------------------------第23回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了2伤害
# 小兵B剩余血量17/60
# 小兵B开始攻击齐天大圣
# 小兵B的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量261/350
#
# -------------------------第24回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了9伤害
# 小兵B剩余血量8/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了7伤害
# 齐天大圣剩余血量254/350
#
# -------------------------第25回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了3伤害
# 小兵B剩余血量5/60
# 小兵B开始攻击齐天大圣
# 齐天大圣受到了7伤害
# 齐天大圣剩余血量247/350
#
# -------------------------第26回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了3伤害
# 小兵B剩余血量2/60
# 小兵B开始攻击齐天大圣
# 小兵B的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量247/350
#
# -------------------------第27回合---------------------------
# 齐天大圣(Level:2)开始攻击小兵B
# 小兵B受到了4伤害
# 小兵Blose
# 齐天大圣   Level up !!!
# 小兵B剩余血量-2/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量297/400
#
# -------------------------第28回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了8伤害
# 大BOSS剩余血量54/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量297/400
#
# -------------------------第29回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了8伤害
# 大BOSS剩余血量48/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量297/400
#
# -------------------------第30回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了6伤害
# 大BOSS剩余血量44/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量297/400
#
# -------------------------第31回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了3伤害
# 大BOSS剩余血量43/60
# 大BOSS开始攻击齐天大圣
# 齐天大圣受到了6伤害
# 齐天大圣剩余血量291/400
#
# -------------------------第32回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了3伤害
# 大BOSS剩余血量42/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量291/400
#
# -------------------------第33回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了2伤害
# 大BOSS剩余血量42/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量291/400
#
# -------------------------第34回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了9伤害
# 大BOSS剩余血量35/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量291/400
#
# -------------------------第35回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了4伤害
# 大BOSS剩余血量33/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量291/400
#
# -------------------------第36回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了7伤害
# 大BOSS剩余血量28/60
# 大BOSS开始攻击齐天大圣
# 齐天大圣受到了18伤害
# 齐天大圣剩余血量273/400
#
# -------------------------第37回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了9伤害
# 大BOSS剩余血量21/60
# 大BOSS开始攻击齐天大圣
# 齐天大圣受到了15伤害
# 齐天大圣剩余血量258/400
#
# -------------------------第38回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了7伤害
# 大BOSS剩余血量16/60
# 大BOSS开始攻击齐天大圣
# 齐天大圣受到了12伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第39回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了6伤害
# 大BOSS剩余血量12/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第40回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了0伤害
# 大BOSS剩余血量14/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第41回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了2伤害
# 大BOSS剩余血量14/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第42回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了1伤害
# 大BOSS剩余血量15/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第43回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了2伤害
# 大BOSS剩余血量15/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第44回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了8伤害
# 大BOSS剩余血量9/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第45回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了8伤害
# 大BOSS剩余血量3/60
# 大BOSS开始攻击齐天大圣
# 大BOSS的攻击被闪避英雄未受到伤害！！！
# 齐天大圣受到了0伤害
# 齐天大圣剩余血量246/400
#
# -------------------------第46回合---------------------------
# 齐天大圣(Level:3)开始攻击大BOSS
# 这是个大怪兽！,有一个可以隔挡2血的盾
# 大BOSS受到了10伤害
# 大BOSSlose
# 齐天大圣   Level up !!!
# 大BOSS剩余血量-5/60
# 怪兽全部死亡！！！游戏结束！！！！
# 齐天大圣WIN!!!








